{
    "Python": "Python is a high-level, versatile language known for its readability and wide use in data science, automation, web development, and AI.",
    "JavaScript": "JavaScript is a dynamic scripting language essential for web development, enabling interactive and responsive front-end applications in browsers.",
    "Java": "Java is a statically typed, object-oriented language used for building cross-platform applications, especially in enterprise, Android, and backend development.",
    "C": "C is a low-level procedural language offering fine-grained control over memory and hardware, widely used in systems programming and embedded systems.",
    "C++": "C++ is an extension of C that adds object-oriented features, used for performance-critical software like games, engines, and real-time systems.",
    "C#": "C# is a modern, object-oriented language developed by Microsoft, primarily used in Windows applications, game development with Unity, and enterprise software.",
    "TypeScript": "TypeScript is a superset of JavaScript that adds static typing, improving code maintainability and scalability in large front-end and full-stack applications.",
    "Go": "Go is a statically typed language from Google, designed for simplicity and efficiency in building fast, scalable server-side and cloud applications.",
    "Rust": "Rust is a systems programming language focused on safety and performance, offering memory safety without garbage collection and ideal for secure, concurrent software.",
    "HTML": "HTML is a markup language used to structure content on the web, forming the backbone of all websites alongside CSS and JavaScript.",
    "CSS": "CSS is a stylesheet language that controls the visual appearance of HTML elements, enabling layout, color, and typography customization in web pages.",
    "Lua": "Lua is a lightweight, embeddable scripting language known for speed and ease of integration, commonly used in game engines and embedded systems.",
    "Objective-C": "Objective-C is a superset of C with object-oriented features, historically used for macOS and iOS development before the rise of Swift.",
    "SQL": "SQL is a domain-specific language for managing and querying relational databases, essential for backend data storage and analytics.",
    "Bash": "Bash is a Unix shell and scripting language used for automating tasks, managing systems, and writing shell scripts in Linux environments."
  }
  